lpbeliveau-silabs/sisdk-release/openthread/platform-abstraction/efr32/crypto.c
/*
 *  Copyright (c) 2023, The OpenThread Authors.
 *  All rights reserved.
 *
 *  Redistribution and use in source and binary forms, with or without
 *  modification, are permitted provided that the following conditions are met:
 *  1. Redistributions of source code must retain the above copyright
 *     notice, this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimer in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the
 *     names of its contributors may be used to endorse or promote products
 *     derived from this software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 *  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *  ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *  LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *  POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file
 *   This file implements the OpenThread platform abstraction for PSA.
 *
 */

#include <openthread-core-config.h>
#include <openthread/error.h>
#include <openthread/platform/crypto.h>

#if OPENTHREAD_CONFIG_CRYPTO_LIB == OPENTHREAD_CONFIG_CRYPTO_LIB_PSA
#include "security_manager.h"
#include <stdint.h>
#include <string.h>
#include "common/debug.hpp"
#include "utils/code_utils.h"

#include "em_device.h"
#include <mbedtls/ecdsa.h>
#include <mbedtls/ecp.h>
#include <mbedtls/md.h>
#include <mbedtls/pk.h>
#include "mbedtls/psa_util.h"
#if defined(_SILICON_LABS_32B_SERIES_2)
#include "em_system.h"
#else
#include "sl_hal_system.h"
#endif
#include "sl_memory_manager.h"
#include "sl_psa_crypto.h"
#include "sl_status.h"
#include "sli_psa_crypto.h"

#define PERSISTENCE_KEY_ID_USED_MAX (7)
#define MAX_HMAC_KEY_SIZE (32)

#if !defined(_SILICON_LABS_32B_SERIES_3)
static psa_status_t reImportUnwrapped(const otCryptoKey *aKey, otCryptoKeyRef *aHmacKeyRef);
#endif

static inline otCryptoKeyRef getHmacKeyRef(const otCryptoKey *aKey)
{
    otCryptoKeyRef keyRef = PSA_KEY_ID_NULL;

#if defined(_SILICON_LABS_32B_SERIES_3)
    keyRef = aKey->mKeyRef;
#else
    psa_status_t status = reImportUnwrapped(aKey, &keyRef);
    if (status != PSA_SUCCESS)
    {
        keyRef = PSA_KEY_ID_NULL; // Return invalid key on error
    }
#endif

    return keyRef;
}

sl_status_t sli_ot_crypto_context_init(otCryptoContext *aContext, size_t aContextSize)
{
    sl_status_t status = SL_STATUS_OK;

    otEXPECT_ACTION((aContext != NULL), status = SL_STATUS_INVALID_PARAMETER);

#if OPENTHREAD_CONFIG_CRYPTO_PLATFORM_ALLOCS_CONTEXT
    if (aContext->mContext == NULL)
    {
        status = sl_memory_alloc_advanced(aContextSize,
                                          SL_MEMORY_BLOCK_ALIGN_8_BYTES,
                                          BLOCK_TYPE_SHORT_TERM,
                                          &aContext->mContext);
        otEXPECT(status == SL_STATUS_OK);
        aContext->mContextSize = (uint16_t)aContextSize;
    }
#else
    otEXPECT_ACTION((aContext->mContext != NULL), status = SL_STATUS_INVALID_PARAMETER);
#endif

    otEXPECT_ACTION(((size_t)aContext->mContextSize >= aContextSize), status = SL_STATUS_WOULD_OVERFLOW);
    memset(aContext->mContext, 0, aContextSize);

exit:
    return status;
}

sl_status_t sli_ot_crypto_context_deinit(otCryptoContext *aContext)
{
    sl_status_t status = SL_STATUS_OK;

    otEXPECT_ACTION((aContext != NULL), status = SL_STATUS_INVALID_PARAMETER);
    otEXPECT_ACTION((aContext->mContext != NULL), status = SL_STATUS_INVALID_PARAMETER);

    memset(aContext->mContext, 0, aContext->mContextSize);

#if OPENTHREAD_CONFIG_CRYPTO_PLATFORM_ALLOCS_CONTEXT
    sl_free(aContext->mContext);
    aContext->mContext     = NULL;
    aContext->mContextSize = 0;
#endif

exit:
    return status;
}

// Helper function to convert otCryptoKeyType to psa_key_type_t
static psa_key_type_t getPsaKeyType(otCryptoKeyType aKeyType)
{
    psa_key_type_t aPsaKeyType = 0;

    switch (aKeyType)
    {
    case OT_CRYPTO_KEY_TYPE_RAW:
        aPsaKeyType = PSA_KEY_TYPE_RAW_DATA;
        break;

    case OT_CRYPTO_KEY_TYPE_AES:
        aPsaKeyType = PSA_KEY_TYPE_AES;
        break;

    case OT_CRYPTO_KEY_TYPE_HMAC:
        aPsaKeyType = PSA_KEY_TYPE_HMAC;
        break;

    case OT_CRYPTO_KEY_TYPE_ECDSA:
        aPsaKeyType = PSA_KEY_TYPE_ECC_KEY_PAIR(PSA_ECC_FAMILY_SECP_R1);
        break;

    case OT_CRYPTO_KEY_TYPE_DERIVE:
        aPsaKeyType = PSA_KEY_TYPE_DERIVE;
        break;
    }

    return aPsaKeyType;
}

// Helper function to convert aKeyAlgorithm to psa_algorithm_t
static psa_algorithm_t getPsaAlgorithm(otCryptoKeyAlgorithm aKeyAlgorithm)
{
    psa_algorithm_t aPsaKeyAlgorithm = 0;

    switch (aKeyAlgorithm)
    {
    case OT_CRYPTO_KEY_ALG_VENDOR:
        aPsaKeyAlgorithm = PSA_ALG_VENDOR_FLAG;
        break;

    case OT_CRYPTO_KEY_ALG_AES_ECB:
        aPsaKeyAlgorithm = PSA_ALG_ECB_NO_PADDING;
        break;

    case OT_CRYPTO_KEY_ALG_HMAC_SHA_256:
        aPsaKeyAlgorithm = PSA_ALG_HMAC(PSA_ALG_SHA_256);
        break;

    case OT_CRYPTO_KEY_ALG_ECDSA:
        aPsaKeyAlgorithm = PSA_ALG_ECDSA(PSA_ALG_ANY_HASH);
        break;

    case OT_CRYPTO_KEY_ALG_HKDF_SHA256:
        aPsaKeyAlgorithm = PSA_ALG_HKDF(PSA_ALG_SHA_256);
        break;
    }

    return aPsaKeyAlgorithm;
}

// Helper function to convert aKeyUsage to psa_key_usage_t
static psa_key_usage_t getPsaKeyUsage(int aKeyUsage)
{
    psa_key_usage_t aPsaKeyUsage = 0;

