lpbeliveau-silabs/sisdk-release/openthread/platform-abstraction/efr32/crypto.c
    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_EXPORT)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_EXPORT;
    }

    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_ENCRYPT)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_ENCRYPT;
    }

    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_DECRYPT)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_DECRYPT;
    }

    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_SIGN_HASH)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_SIGN_HASH;
    }

    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_VERIFY_HASH)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_VERIFY_HASH;
    }

    if (aKeyUsage & OT_CRYPTO_KEY_USAGE_DERIVE)
    {
        aPsaKeyUsage |= PSA_KEY_USAGE_DERIVE;
    }

    return aPsaKeyUsage;
}

// Helper function to convert otCryptoKeyStorage to psa_key_persistence_t
static psa_key_persistence_t getPsaKeyPersistence(otCryptoKeyStorage aKeyPersistence)
{
    psa_key_persistence_t aPsaKeyPersistence = 0;

    switch (aKeyPersistence)
    {
    case OT_CRYPTO_KEY_STORAGE_VOLATILE:
        aPsaKeyPersistence = PSA_KEY_PERSISTENCE_VOLATILE;
        break;

    case OT_CRYPTO_KEY_STORAGE_PERSISTENT:
        aPsaKeyPersistence = PSA_KEY_PERSISTENCE_DEFAULT;
        break;
    }

    return aPsaKeyPersistence;
}

// Helper function to map sl_status_t status codes to OpenThread error codes
static otError mapSlStatusToOtError(sl_status_t status)
{
    otError error = OT_ERROR_NONE;

    switch (status)
    {
    case SL_STATUS_OK:
        error = OT_ERROR_NONE;
        break;
    case SL_STATUS_INVALID_PARAMETER:
        error = OT_ERROR_INVALID_ARGS;
        break;
    case SL_STATUS_WOULD_OVERFLOW:
    case SL_STATUS_ALLOCATION_FAILED:
    case SL_STATUS_NO_MORE_RESOURCE:
        error = OT_ERROR_NO_BUFS;
        break;
    default:
        error = OT_ERROR_FAILED;
        break;
    }

    return error;
}

// Helper function to map psa_status_t status codes to OpenThread error codes
static otError mapPsaStatusToOtError(psa_status_t status)
{
    otError error = OT_ERROR_NONE;
    switch (status)
    {
    case PSA_SUCCESS:
        error = OT_ERROR_NONE;
        break;

    case PSA_ERROR_INVALID_ARGUMENT:
        error = OT_ERROR_INVALID_ARGS;
        break;

    case PSA_ERROR_DATA_INVALID:
        error = OT_ERROR_PARSE;
        break;

    case PSA_ERROR_NOT_SUPPORTED:
        error = OT_ERROR_NOT_IMPLEMENTED;
        break;

    case PSA_ERROR_ALREADY_EXISTS:
        error = OT_ERROR_ALREADY;
        break;

    case PSA_ERROR_BAD_STATE:
        error = OT_ERROR_INVALID_STATE;
        break;

    case PSA_ERROR_INVALID_HANDLE:
        error = OT_ERROR_NOT_FOUND;
        break;

    case PSA_ERROR_INSUFFICIENT_DATA:
    case PSA_ERROR_INSUFFICIENT_STORAGE:
    case PSA_ERROR_INSUFFICIENT_MEMORY:
    case PSA_ERROR_BUFFER_TOO_SMALL:
        error = OT_ERROR_NO_BUFS;
        break;

    case PSA_ERROR_INVALID_SIGNATURE:
    case PSA_ERROR_DATA_CORRUPT:
    case PSA_ERROR_CORRUPTION_DETECTED:
    case PSA_ERROR_NOT_PERMITTED:
    case PSA_ERROR_INSUFFICIENT_ENTROPY:
        error = OT_ERROR_SECURITY;
        break;

    case PSA_ERROR_COMMUNICATION_FAILURE:
        error = OT_ERROR_FAILED;
        break;

    default:
        error = OT_ERROR_FAILED;
        break;
    }

    return error;
}

#if defined(SEMAILBOX_PRESENT) && !defined(SL_TRUSTZONE_NONSECURE)
static bool shouldWrap(psa_key_attributes_t *key_attr)
{
    psa_key_location_t keyLocation = PSA_KEY_LIFETIME_GET_LOCATION(psa_get_key_lifetime(key_attr));
    psa_key_type_t     keyType     = psa_get_key_type(key_attr);

    return ((keyLocation != SL_PSA_KEY_LOCATION_WRAPPED) && (keyType != PSA_KEY_TYPE_HMAC));
}

static void checkAndWrapKeys(void)
{
    for (int index = 1; index <= PERSISTENCE_KEY_ID_USED_MAX; index++)
    {
        otCryptoKeyRef       key_ref  = OPENTHREAD_CONFIG_PSA_ITS_NVM_OFFSET + index;
        psa_key_attributes_t key_attr = PSA_KEY_ATTRIBUTES_INIT;

        // If there is a key present in the location..
        if (sl_sec_man_get_key_attributes(key_ref, &key_attr) == PSA_SUCCESS)
        {
            if (shouldWrap(&key_attr))
            {
                // Wrap the key..
                otCryptoKeyRef     dst_key_ref = key_ref;
                psa_key_lifetime_t key_lifetime =
                    PSA_KEY_LIFETIME_FROM_PERSISTENCE_AND_LOCATION(PSA_KEY_PERSISTENCE_DEFAULT,
                                                                   SL_PSA_KEY_LOCATION_WRAPPED);

                psa_set_key_lifetime(&key_attr, key_lifetime);
                sl_sec_man_copy_key(key_ref, &key_attr, &dst_key_ref);
            }
        }
    }
}
#endif // SEMAILBOX_PRESENT && !SL_TRUSTZONE_NONSECURE

void otPlatCryptoInit(void)
{
#if defined(SEMAILBOX_PRESENT) && !defined(SL_TRUSTZONE_NONSECURE)
    if (sl_psa_get_most_secure_key_location() == SL_PSA_KEY_LOCATION_WRAPPED)
    {
        checkAndWrapKeys();
    }
#endif
}

static otError extractPrivateKeyFromDer(uint8_t *aPrivateKey, const uint8_t *aDer, uint8_t aDerLen)
{
    otError              error = OT_ERROR_NONE;
    mbedtls_pk_context   pk;
    mbedtls_ecp_keypair *keyPair;
    int                  ret;

    mbedtls_pk_init(&pk);

    otEXPECT_ACTION(mbedtls_pk_setup(&pk, mbedtls_pk_info_from_type(MBEDTLS_PK_ECKEY)) == 0, error = OT_ERROR_FAILED);

#if (MBEDTLS_VERSION_NUMBER >= 0x03000000)
    otEXPECT_ACTION(mbedtls_pk_parse_key(&pk, aDer, aDerLen, NULL, 0, mbedtls_psa_get_random, MBEDTLS_PSA_RANDOM_STATE)
                        == 0,
                    error = OT_ERROR_PARSE);
#else
    otEXPECT_ACTION(mbedtls_pk_parse_key(&pk, aDer, aDerLen, NULL, 0) == 0, error = OT_ERROR_PARSE);
#endif

    keyPair = mbedtls_pk_ec(pk);
#if (MBEDTLS_VERSION_NUMBER >= 0x03060000)
    {
        size_t olen = 0;
        ret         = mbedtls_ecp_write_key_ext(keyPair, &olen, aPrivateKey, SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE);
    }
#else
    ret = mbedtls_ecp_write_key(keyPair, aPrivateKey, SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE);
#endif
    otEXPECT_ACTION(ret == 0, error = OT_ERROR_FAILED);

exit:
    mbedtls_pk_free(&pk);
    return error;
}

