lpbeliveau-silabs/sisdk-release/openthread/platform-abstraction/efr32/crypto.c
otError otPlatCryptoImportKey(otCryptoKeyRef      *aKeyId,
                              otCryptoKeyType      aKeyType,
                              otCryptoKeyAlgorithm aKeyAlgorithm,
                              int                  aKeyUsage,
                              otCryptoKeyStorage   aKeyPersistence,
                              const uint8_t       *aKey,
                              size_t               aKeyLen)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    // Zero-init to avoid accidental use of uninitialized stack data if DER parsing fails.
    uint8_t         aPrivateKey[SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE] = {0};
    const uint8_t  *keyToImport                                       = aKey;
    size_t          keySize                                           = aKeyLen;
    psa_key_usage_t keyUsageMask                                      = 0;

    if (aKeyType == OT_CRYPTO_KEY_TYPE_ECDSA)
    {
        error = extractPrivateKeyFromDer(aPrivateKey, aKey, aKeyLen);
        // If DER parsing fails, do not attempt to import potentially invalid/uninitialized key material.
        otEXPECT(error == OT_ERROR_NONE);
        keyToImport = aPrivateKey;
        keySize     = SL_OPENTHREAD_ECDSA_PRIVATE_KEY_SIZE;
    }

#if defined(LPWAES_PRESENT) && (defined(KSU_PRESENT))
    bool is_aes_ecb_key = (aKeyType == OT_CRYPTO_KEY_TYPE_AES) && (aKeyAlgorithm == OT_CRYPTO_KEY_ALG_AES_ECB)
                          && ((aKeyUsage & OT_CRYPTO_KEY_USAGE_ENCRYPT) != 0)
                          && ((aKeyUsage & OT_CRYPTO_KEY_USAGE_DECRYPT) != 0);
    keyUsageMask = is_aes_ecb_key ? PSA_KEY_USAGE_COPY : 0;
#endif
    status = sl_sec_man_import_key(aKeyId,
                                   getPsaKeyType(aKeyType),
                                   getPsaAlgorithm(aKeyAlgorithm),
                                   getPsaKeyUsage(aKeyUsage) | keyUsageMask,
                                   getPsaKeyPersistence(aKeyPersistence),
                                   keyToImport,
                                   keySize);

    error = mapPsaStatusToOtError(status);

exit:
    // clear extracted private key bytes (stack buffer).
    memset(aPrivateKey, 0, sizeof(aPrivateKey));
    return error;
}

otError otPlatCryptoExportKey(otCryptoKeyRef aKeyId, uint8_t *aBuffer, size_t aBufferLen, size_t *aKeyLen)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;

    status = sl_sec_man_export_key(aKeyId, aBuffer, aBufferLen, aKeyLen);

    error = mapPsaStatusToOtError(status);

    return error;
}

otError otPlatCryptoDestroyKey(otCryptoKeyRef aKeyId)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;

    status = sl_sec_man_destroy_key(aKeyId);

    error = mapPsaStatusToOtError(status);

    return error;
}

bool otPlatCryptoHasKey(otCryptoKeyRef aKeyRef)
{
    psa_key_attributes_t aAttr = PSA_KEY_ATTRIBUTES_INIT;

    return (sl_sec_man_get_key_attributes(aKeyRef, &aAttr) == PSA_SUCCESS);
}

// AES  Implementation
otError otPlatCryptoAesInit(otCryptoContext *aContext)
{
    otError     error = OT_ERROR_NONE;
    sl_status_t status;

    // PSA AES ECB stores `otCryptoKeyRef` (PSA key id) in `mContext`.
    status = sli_ot_crypto_context_init(aContext, sizeof(otCryptoKeyRef));
    otEXPECT_ACTION(status == SL_STATUS_OK, error = mapSlStatusToOtError(status));

    *(otCryptoKeyRef *)aContext->mContext = PSA_KEY_ID_NULL;

exit:
    return error;
}

otError otPlatCryptoAesSetKey(otCryptoContext *aContext, const otCryptoKey *aKey)
{
    otError         error   = OT_ERROR_NONE;
    otCryptoKeyRef *mKeyRef = NULL;

    otEXPECT_ACTION((aContext != NULL) && (aContext->mContext != NULL), error = OT_ERROR_INVALID_ARGS);

    mKeyRef  = (otCryptoKeyRef *)aContext->mContext;
    *mKeyRef = aKey->mKeyRef;

exit:
    return error;
}

otError otPlatCryptoAesEncrypt(otCryptoContext *aContext, const uint8_t *aInput, uint8_t *aOutput)
{
    otError         error = OT_ERROR_NONE;
    psa_status_t    status;
    otCryptoKeyRef *mKeyRef = NULL;

    otEXPECT_ACTION(((aContext != NULL) && (aContext->mContext != NULL) && (aOutput != NULL) && (aInput != NULL)),
                    error = OT_ERROR_INVALID_ARGS);
    mKeyRef = (otCryptoKeyRef *)aContext->mContext;
    status  = sl_sec_man_aes_encrypt(*mKeyRef, PSA_ALG_ECB_NO_PADDING, aInput, aOutput);

    error = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoAesFree(otCryptoContext *aContext)
{
    otError     error = OT_ERROR_NONE;
    sl_status_t status;

    status = sli_ot_crypto_context_deinit(aContext);
    otEXPECT_ACTION(status == SL_STATUS_OK, error = mapSlStatusToOtError(status));

exit:
    return error;
}

// HMAC implementations
otError otPlatCryptoHmacSha256Init(otCryptoContext *aContext)
{
    otError     error = OT_ERROR_NONE;
    sl_status_t status;
    size_t      contextSize;

    contextSize = sli_psa_context_get_size(SLI_PSA_CONTEXT_ENUM_NAME(psa_mac_operation_t));
    status      = sli_ot_crypto_context_init(aContext, contextSize);
    otEXPECT_ACTION(status == SL_STATUS_OK, error = mapSlStatusToOtError(status));

    *(psa_mac_operation_t *)aContext->mContext = psa_mac_operation_init();

exit:
    return error;
}

otError otPlatCryptoHmacSha256Deinit(otCryptoContext *aContext)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    sl_status_t  slstatus = SL_STATUS_OK;

    otEXPECT_ACTION((aContext != NULL) && (aContext->mContext != NULL), error = OT_ERROR_INVALID_ARGS);

    status = sl_sec_man_hmac_deinit((psa_mac_operation_t *)aContext->mContext);
    error  = mapPsaStatusToOtError(status);

    slstatus = sli_ot_crypto_context_deinit(aContext);
    if (error == OT_ERROR_NONE)
    {
        otEXPECT_ACTION(slstatus == SL_STATUS_OK, error = mapSlStatusToOtError(slstatus));
    }

exit:
    return error;
}

#if !defined(_SILICON_LABS_32B_SERIES_3)
static psa_status_t reImportUnwrapped(const otCryptoKey *aKey, otCryptoKeyRef *aHmacKeyRef)
{
    psa_status_t status = PSA_SUCCESS;

#if defined(SEMAILBOX_PRESENT)
    uint8_t              hmacKeyBytes[MAX_HMAC_KEY_SIZE];
    size_t               key_size;
    psa_key_attributes_t key_attr = PSA_KEY_ATTRIBUTES_INIT;

    status = sl_sec_man_get_key_attributes(aKey->mKeyRef, &key_attr);

