lpbeliveau-silabs/sisdk-release/openthread/platform-abstraction/efr32/crypto.c
    otEXPECT(status == PSA_SUCCESS);

    status = sl_sec_man_export_key(aKey->mKeyRef, hmacKeyBytes, sizeof(hmacKeyBytes), &key_size);

    otEXPECT(status == PSA_SUCCESS);

    status = sl_sec_man_import_key(aHmacKeyRef,
                                   psa_get_key_type(&key_attr),
                                   psa_get_key_algorithm(&key_attr),
                                   psa_get_key_usage_flags(&key_attr),
                                   PSA_KEY_PERSISTENCE_VOLATILE,
                                   hmacKeyBytes,
                                   key_size);

    memset(hmacKeyBytes, 0, sizeof(hmacKeyBytes));

    otEXPECT(status == PSA_SUCCESS);

exit:
#else
    *aHmacKeyRef = aKey->mKeyRef;
#endif
    return status;
}
#endif

otError otPlatCryptoHmacSha256Start(otCryptoContext *aContext, const otCryptoKey *aKey)
{
    otError              error         = OT_ERROR_NONE;
    psa_mac_operation_t *mMacOperation = (psa_mac_operation_t *)aContext->mContext;
    psa_status_t         status;
    otCryptoKeyRef       hmacKeyRef;

    hmacKeyRef = getHmacKeyRef(aKey);
    otEXPECT_ACTION(hmacKeyRef != PSA_KEY_ID_NULL, error = OT_ERROR_FAILED);

    status = sl_sec_man_hmac_start(mMacOperation, hmacKeyRef);
    error  = mapPsaStatusToOtError(status);

#if defined(SEMAILBOX_PRESENT) && !defined(_SILICON_LABS_32B_SERIES_3)
    sl_sec_man_destroy_key(hmacKeyRef);
#else
    hmacKeyRef = PSA_KEY_ID_NULL;
#endif

exit:
    return error;
}

otError otPlatCryptoHmacSha256Update(otCryptoContext *aContext, const void *aBuf, uint16_t aBufLength)
{
    otError              error         = OT_ERROR_NONE;
    psa_mac_operation_t *mMacOperation = (psa_mac_operation_t *)aContext->mContext;
    psa_status_t         status;

    status = sl_sec_man_hmac_update(mMacOperation, (const uint8_t *)aBuf, (size_t)aBufLength);

    error = mapPsaStatusToOtError(status);

    return error;
}

otError otPlatCryptoHmacSha256Finish(otCryptoContext *aContext, uint8_t *aBuf, size_t aBufLength)
{
    otError              error         = OT_ERROR_NONE;
    psa_mac_operation_t *mMacOperation = (psa_mac_operation_t *)aContext->mContext;
    psa_status_t         status;

    status = sl_sec_man_hmac_finish(mMacOperation, aBuf, aBufLength);

    error = mapPsaStatusToOtError(status);

    return error;
}

// SHA256 platform implementations
otError otPlatCryptoSha256Init(otCryptoContext *aContext)
{
    otError     error = OT_ERROR_NONE;
    sl_status_t status;
    size_t      contextSize;

    contextSize = sli_psa_context_get_size(SLI_PSA_CONTEXT_ENUM_NAME(psa_hash_operation_t));
    status      = sli_ot_crypto_context_init(aContext, contextSize);
    otEXPECT_ACTION(status == SL_STATUS_OK, error = mapSlStatusToOtError(status));

    *(psa_hash_operation_t *)aContext->mContext = sl_sec_man_hash_init();

exit:
    return error;
}

otError otPlatCryptoSha256Deinit(otCryptoContext *aContext)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    sl_status_t  slstatus = SL_STATUS_OK;

    otEXPECT_ACTION((aContext != NULL) && (aContext->mContext != NULL), error = OT_ERROR_INVALID_ARGS);

    status = sl_sec_man_hash_deinit((psa_hash_operation_t *)aContext->mContext);
    error  = mapPsaStatusToOtError(status);

    slstatus = sli_ot_crypto_context_deinit(aContext);
    if (error == OT_ERROR_NONE)
    {
        otEXPECT_ACTION(slstatus == SL_STATUS_OK, error = mapSlStatusToOtError(slstatus));
    }

exit:
    return error;
}

otError otPlatCryptoSha256Start(otCryptoContext *aContext)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    otEXPECT_ACTION((aContext != NULL), error = OT_ERROR_INVALID_ARGS);
    psa_hash_operation_t *ctx = (psa_hash_operation_t *)aContext->mContext;

    otEXPECT_ACTION((ctx != NULL), error = OT_ERROR_INVALID_ARGS);
    status = sl_sec_man_hash_start(ctx, PSA_ALG_SHA_256);
    error  = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoSha256Update(otCryptoContext *aContext, const void *aBuf, uint16_t aBufLength)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    otEXPECT_ACTION((aContext != NULL), error = OT_ERROR_INVALID_ARGS);
    psa_hash_operation_t *ctx = (psa_hash_operation_t *)aContext->mContext;

    otEXPECT_ACTION(((ctx != NULL) && (aBuf != NULL)), error = OT_ERROR_INVALID_ARGS);
    status = sl_sec_man_hash_update(ctx, (uint8_t *)aBuf, aBufLength);
    error  = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoSha256Finish(otCryptoContext *aContext, uint8_t *aHash, uint16_t aHashSize)
{
    otError      error       = OT_ERROR_NONE;
    size_t       aHashLength = 0;
    psa_status_t status;
    otEXPECT_ACTION((aContext != NULL), error = OT_ERROR_INVALID_ARGS);
    psa_hash_operation_t *ctx = (psa_hash_operation_t *)aContext->mContext;

    otEXPECT_ACTION(((ctx != NULL) && (aHash != NULL)), error = OT_ERROR_INVALID_ARGS);
    status = sl_sec_man_hash_finish(ctx, aHash, aHashSize, &aHashLength);
    error  = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoEcdsaGenerateAndImportKey(otCryptoKeyRef aKeyRef)
{
    otError      error      = OT_ERROR_NONE;
    size_t       aKeyLength = 256;
    psa_status_t status;

    status = sl_sec_man_generate_key(&aKeyRef,
                                     PSA_KEY_TYPE_ECC_KEY_PAIR(PSA_ECC_FAMILY_SECP_R1),
                                     PSA_ALG_ECDSA(PSA_ALG_ANY_HASH),
                                     (PSA_KEY_USAGE_SIGN_HASH | PSA_KEY_USAGE_VERIFY_HASH),
                                     PSA_KEY_LIFETIME_PERSISTENT,
                                     aKeyLength);

    error = mapPsaStatusToOtError(status);

    return error;
}

otError otPlatCryptoEcdsaExportPublicKey(otCryptoKeyRef aKeyRef, otPlatCryptoEcdsaPublicKey *aPublicKey)
{
    otError      error = OT_ERROR_NONE;
    size_t       aKeyLength;
    psa_status_t status;
    uint8_t      aByteArray[OT_CRYPTO_ECDSA_PUBLIC_KEY_SIZE + 1];

    otEXPECT_ACTION((aPublicKey != NULL), error = OT_ERROR_INVALID_ARGS);

    // Use byte array to get the public key because PSA adds a encoding header at the beginning of the array.
    // It is easier to export it to a byte array and copy only the public key to output array.
    status = sl_sec_man_export_public_key(aKeyRef, aByteArray, sizeof(aByteArray), &aKeyLength);

    memcpy(aPublicKey->m8, &aByteArray[1], OT_CRYPTO_ECDSA_PUBLIC_KEY_SIZE);
    error = mapPsaStatusToOtError(status);

