lpbeliveau-silabs/sisdk-release/openthread/platform-abstraction/efr32/crypto.c
exit:
    return error;
}

otError otPlatCryptoEcdsaSignUsingKeyRef(otCryptoKeyRef                aKeyRef,
                                         const otPlatCryptoSha256Hash *aHash,
                                         otPlatCryptoEcdsaSignature   *aSignature)
{
    otError      error = OT_ERROR_NONE;
    size_t       aSignatureLength;
    psa_status_t status;
    bool         aIsHash = true;

    otEXPECT_ACTION(((aHash != NULL) && (aSignature != NULL)), error = OT_ERROR_INVALID_ARGS);

    status = sl_sec_man_sign(aKeyRef,
                             PSA_ALG_ECDSA(PSA_ALG_SHA_256),
                             aHash->m8,
                             sizeof(aHash->m8),
                             aSignature->m8,
                             sizeof(aSignature->m8),
                             &aSignatureLength,
                             aIsHash);

    error = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoEcdsaVerifyUsingKeyRef(otCryptoKeyRef                    aKeyRef,
                                           const otPlatCryptoSha256Hash     *aHash,
                                           const otPlatCryptoEcdsaSignature *aSignature)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    bool         aIsHash = true;

    otEXPECT_ACTION(((aHash != NULL) && (aSignature != NULL)), error = OT_ERROR_INVALID_ARGS);

    // Verify the signature.
    status = sl_sec_man_verify(aKeyRef,
                               PSA_ALG_ECDSA(PSA_ALG_SHA_256),
                               aHash->m8,
                               sizeof(aHash->m8),
                               aSignature->m8,
                               sizeof(aSignature->m8),
                               aIsHash);

    error = mapPsaStatusToOtError(status);

exit:
    return error;
}

otError otPlatCryptoPbkdf2GenerateKey(const uint8_t *aPassword,
                                      uint16_t       aPasswordLen,
                                      const uint8_t *aSalt,
                                      uint16_t       aSaltLen,
                                      uint32_t       aIterationCounter,
                                      uint16_t       aKeyLen,
                                      uint8_t       *aKey)
{
    otError      error = OT_ERROR_NONE;
    psa_status_t status;
    size_t       outSize;
    psa_key_id_t passwordKeyId = 0;
    psa_key_id_t saltKeyId     = 0;
    psa_key_id_t keyId         = 0;

    // Algorithm is PBKDF2-AES-CMAC-PRF-128
    psa_algorithm_t algo = PSA_ALG_PBKDF2_AES_CMAC_PRF_128;

    // Initialize key derivation
    psa_key_derivation_operation_t operation = psa_key_derivation_operation_init();
    status                                   = psa_key_derivation_setup(&operation, algo);
    error                                    = mapPsaStatusToOtError(status);

    // Set capacity
    status = psa_key_derivation_set_capacity(&operation, aKeyLen);
    error  = mapPsaStatusToOtError(status);

    // Set iteration count as cost
    status = psa_key_derivation_input_integer(&operation, PSA_KEY_DERIVATION_INPUT_COST, aIterationCounter);
    error  = mapPsaStatusToOtError(status);

    // Create salt as a key
    psa_key_attributes_t saltKeyAttr = psa_key_attributes_init();
    psa_set_key_usage_flags(&saltKeyAttr, PSA_KEY_USAGE_DERIVE);
    psa_set_key_type(&saltKeyAttr, PSA_KEY_TYPE_RAW_DATA);
    psa_set_key_algorithm(&saltKeyAttr, algo);
    error = mapPsaStatusToOtError(status);

    status = psa_import_key(&saltKeyAttr, aSalt, aSaltLen, &saltKeyId);
    error  = mapPsaStatusToOtError(status);

    // Provide salt
    status = psa_key_derivation_input_key(&operation, PSA_KEY_DERIVATION_INPUT_SALT, saltKeyId);
    error  = mapPsaStatusToOtError(status);

    // Create key for password (key)
    psa_key_attributes_t passwordKeyAttr = psa_key_attributes_init();
    psa_set_key_usage_flags(&passwordKeyAttr, PSA_KEY_USAGE_DERIVE);
    psa_set_key_type(&passwordKeyAttr, PSA_KEY_TYPE_PASSWORD);
    psa_set_key_algorithm(&passwordKeyAttr, algo);

    status = psa_import_key(&passwordKeyAttr, aPassword, aPasswordLen, &passwordKeyId);
    error  = mapPsaStatusToOtError(status);

    // Provide password (key)
    status = psa_key_derivation_input_key(&operation, PSA_KEY_DERIVATION_INPUT_PASSWORD, passwordKeyId);
    error  = mapPsaStatusToOtError(status);

    // Configure output as a key
    psa_key_attributes_t keyAttrResult = psa_key_attributes_init();
    psa_set_key_bits(&keyAttrResult, (8 * aKeyLen));
    psa_set_key_usage_flags(&keyAttrResult, PSA_KEY_USAGE_EXPORT);
    psa_set_key_type(&keyAttrResult, PSA_KEY_TYPE_RAW_DATA);
    psa_set_key_algorithm(&keyAttrResult, PSA_ALG_CTR);

    status = psa_key_derivation_output_key(&keyAttrResult, &operation, &keyId);
    error  = mapPsaStatusToOtError(status);

    // Export output key
    status = psa_export_key(keyId, aKey, aKeyLen, &outSize);
    error  = mapPsaStatusToOtError(status);

    // Release keys used
    psa_destroy_key(keyId);
    psa_destroy_key(saltKeyId);
    psa_destroy_key(passwordKeyId);

    return error;
}

otError otPlatCryptoEcdsaVerify(const otPlatCryptoEcdsaPublicKey *aPublicKey,
                                const otPlatCryptoSha256Hash     *aHash,
                                const otPlatCryptoEcdsaSignature *aSignature)
{
    otError        error = OT_ERROR_NONE;
    psa_status_t   status;
    bool           aIsHash = true;
    uint8_t        aByteArray[OT_CRYPTO_ECDSA_PUBLIC_KEY_SIZE + 1];
    otCryptoKeyRef aKeyId;

    otEXPECT_ACTION(((aPublicKey != NULL) && (aHash != NULL) && (aSignature != NULL)), error = OT_ERROR_INVALID_ARGS);

    // Public key needs a extra byt of encoding header, which has a value of 0x04, to be included for PSA to validate
    // and process the publc key. Copy the key into a new temp array and append the encoding header to it.
    aByteArray[0] = 0x04;
    memcpy(&aByteArray[1], aPublicKey, OT_CRYPTO_ECDSA_PUBLIC_KEY_SIZE);

    // Import the public key into a temp slot.
    status = sl_sec_man_import_key(&aKeyId,
                                   PSA_KEY_TYPE_ECC_PUBLIC_KEY(PSA_ECC_FAMILY_SECP_R1),
                                   PSA_ALG_ECDSA(PSA_ALG_ANY_HASH),
                                   PSA_KEY_USAGE_VERIFY_HASH,
                                   PSA_KEY_PERSISTENCE_VOLATILE,
                                   aByteArray,
                                   OT_CRYPTO_ECDSA_PUBLIC_KEY_SIZE + 1); // To account for the padded byte.

    // If key import fails, assert, as we cannot proceed
    OT_ASSERT(status == PSA_SUCCESS);

    // Verify the signature.
    status = sl_sec_man_verify(aKeyId,
                               PSA_ALG_ECDSA(PSA_ALG_SHA_256),
                               aHash->m8,
                               sizeof(aHash->m8),
                               aSignature->m8,
                               sizeof(aSignature->m8),
                               aIsHash);

    // Destroy the temp key.
    sl_sec_man_destroy_key(aKeyId);

    error = mapPsaStatusToOtError(status);

exit:
    return error;
}

#endif // OPENTHREAD_CONFIG_CRYPTO_LIB == OPENTHREAD_CONFIG_CRYPTO_LIB_PSA
